Masmiseim36/nxpSDK/boards/twrkv46f150m/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief FTM0 channel 0 output source: FTM0_CH0 pin is output of FTM0 channel 0 output */
#define SOPT8_FTM0OCH0SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 1 output source: FTM0_CH1 pin is output of FTM0 channel 1 output */
#define SOPT8_FTM0OCH1SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 2 output source: FTM0_CH2 pin is output of FTM0 channel 2 output */
#define SOPT8_FTM0OCH2SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 3 output source: FTM0_CH3 pin is output of FTM0 channel 3 output */
#define SOPT8_FTM0OCH3SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 4 output source: FTM0_CH4 pin is output of FTM0 channel 4 output */
#define SOPT8_FTM0OCH4SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 5 output source: FTM0_CH5 pin is output of FTM0 channel 5 output */
#define SOPT8_FTM0OCH5SRC_FTM 0x00u

/*! @name PORTD0 (number 93), J500[A40]/J501[9]/GPIOD0/PWM_A0/LED0
  @{ */
#define PINTOOL_PWM_PWM_A0_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_A0_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                      /* @} */

/*! @name PORTD2 (number 95), J500[A38]/J501[30]/GPIOD2/PWM_A1/LED2
  @{ */
#define PINTOOL_PWM_PWM_A1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_A1_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                      /* @} */

/*! @name PORTD4 (number 97), J500[B40]/J501[34]/GPIOD4/PWM_A2/LED4
  @{ */
#define PINTOOL_PWM_PWM_A2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_A2_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                      /* @} */

/*! @name PORTD1 (number 94), J500[A39]/J501[11]/GPIOD1/PWM_B0/LED1
  @{ */
#define PINTOOL_PWM_PWM_B0_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_B0_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                      /* @} */

/*! @name PORTD3 (number 96), J500[A37]/J501[32]/GPIOD3/PWM_B1/LED3
  @{ */
#define PINTOOL_PWM_PWM_B1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_B1_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                      /* @} */

/*! @name PORTD5 (number 98), J500[B39]/J501[36]/GPIOD5/PWM_B2/LED5
  @{ */
#define PINTOOL_PWM_PWM_B2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_B2_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_PWM(void);

/*! @name ADCA_CH3 (number 19), J500[A30]/J501[6]
  @{ */
/* @} */

/*! @name PORTE17 (number 11), J500[A28]/J501[12]/GPIOE17/ADCA_CH1
  @{ */
#define BOARD_ADCA_PHC_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_ADCA_PHC_PIN 17U    /*!<@brief PORTE pin index: 17 */
                                  /* @} */

/*! @name PORTE18 (number 12), J500[B30]/J501[18]/ADCB_CH0
  @{ */
#define BOARD_ADCB_UDCB_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_ADCB_UDCB_PIN 18U    /*!<@brief PORTE pin index: 18 */
                                   /* @} */

/*! @name PORTE19 (number 13), J500[B29]/J501[20]/ADCB_CH1
  @{ */
#define BOARD_ADCB_PHA_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_ADCB_PHA_PIN 19U    /*!<@brief PORTE pin index: 19 */
                                  /* @} */

/*! @name PORTB1 (number 54), J500[B27]/J501[33]/GPIOB1/ADCB_CH3
  @{ */
#define BOARD_ADCB_PHB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_ADCB_PHB_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_ADC(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 receive data source select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_OSC(void);

/*! @name PORTE6 (number 7), SW2
  @{ */
#define PINTOOL_MISC_SW2_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_MISC_SW2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_SW2_PIN 6U     /*!<@brief PORTE pin index: 6 */
                                    /* @} */

/*! @name PORTE24 (number 31), J1[2]/J500[B21]/J501[35]/GPIOE24/ADCB_CH4/THM2JP
  @{ */
#define PINTOOL_MISC_USER_LED_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_MISC_USER_LED_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_USER_LED_PIN 24U    /*!<@brief PORTE pin index: 24 */
                                         /* @} */

/*! @name PORTB16 (number 62), J500[B52]/J502[1]/GPIOB16/XBARIN5
  @{ */
#define PINTOOL_MISC_DRV_EN_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_DRV_EN_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_DRV_EN_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

/*! @name PORTA14 (number 44), J500[B46]/J502[16]/GPIOA14/SPI_CS0
  @{ */
#define PINTOOL_SPI_SPI_CS_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_CS_PIN 14U    /*!<@brief PORTA pin index: 14 */
                                      /* @} */

/*! @name PORTA15 (number 45), J500[B48]/J502[20]/GPIOA15/SPI_SCK
  @{ */
#define PINTOOL_SPI_SPI_SCK_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_SCK_PIN 15U    /*!<@brief PORTA pin index: 15 */
                                       /* @} */

/*! @name PORTA16 (number 46), J500[B45]/J502[22]/GPIOA16/SPI_SOUT
  @{ */
#define PINTOOL_SPI_SPI_SOUT_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_SOUT_PIN 16U    /*!<@brief PORTA pin index: 16 */
                                        /* @} */

/*! @name PORTA17 (number 47), J500[B44]/J502[18]/GPIOA17/SPI_SIN
  @{ */
#define PINTOOL_SPI_SPI_SIN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_SIN_PIN 17U    /*!<@brief PORTA pin index: 17 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_SPI(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
